# tmux
stow
curl
foot foot-themes
manpages-dev
info
make
build-essential
ranger # if version<1.9.4 and image setup doesn't work, use Scripts/ranger-git-install.sh instead
# qutebrowser # install using installation script, apt version very outdated
zsh
zsh-autosuggestions
zsh-syntax-highlighting
vim-athena vim-scripts vim-doc
git

gcc
clang-format
cscope
cmake
universal-ctags
python3-pygments

# not sure if needed
pm-utils # power management

zip
unzip
xz-utils
trash-cli # https://github.com/andreafrancia/trash-cli
rlwrap

# transmission-gtk

ripgrep less fzf bat

network-manager network-manager-config-connectivity-debian
swaylock xdg-desktop-portal-wlr xwayland wdisplays tofi swayidle brightnessctl
sway-notification-center swayimg grimshot
blueman libspa-0.2-bluetooth # https://askubuntu.com/a/1480049

software-properties-common
mpv yt-dlp/bookworm-backports

pulseaudio-utils
pavucontrol
pamixer
net-tools

vlc obs-studio evince nautilus foliate

luarocks

qemu-system
libvirt-daemon-system
virt-manager

podman distrobox

neofetch fortune cowsay figlet toilet cmatrix

# optional lisp dev deps
# sbcl sbcl-doc guile-3.0 guile-3.0-doc

