# tmux
stow
curl
foot
foot-themes
manpages-dev
info
make
build-essential
#ranger# if version<1.9.4 and image setup doesn't work, use Scripts/ranger-git-install.sh instead
zsh
zsh-autosuggestions
zsh-syntax-highlighting
vim-gtk3
vim-scripts
vim-doc
git
btop

gcc
manpages-dev
manpages-posix-dev
gdb
gdb-doc
valgrind
tcc# tiny c compiler
clang-format
cscope
cmake
universal-ctags
python3-pygments

# swig: simple wrapper and interface generator
# https://www.swig.org/tutorial.html
swig
swig-doc
swig-examples

# language servers
# python3-pylsp # not working well, better install it inside venv, uv, poetry or using pipx (for system-wide installation)
# ccls
clangd
bear
# bear -- <your-build-command>
# https://github.com/rizsotto/Bear

# not sure if needed
pm-utils# power management

zip
unzip
xz-utils
trash-cli# https://github.com/andreafrancia/trash-cli
rlwrap

# transmission-gtk

ripgrep
less
fzf
bat

sway
qtwayland5
swaylock
xdg-desktop-portal-wlr
xwayland
wdisplays
tofi
swayidle
brightnessctl
sway-notification-center
swayimg
grimshot
blueman
libspa-0.2-bluetooth# https://askubuntu.com/a/1480049

software-properties-common
#mpv yt-dlp/bookworm-backports

pulseaudio-utils
pavucontrol
pamixer
net-tools

vlc
obs-studio
evince
nautilus
foliate

#luarocks

qemu-system
libvirt-daemon-system
virt-manager

podman
pipx
#distrobox

#librewolf
firefox-esr
chromium
#neofetch
#fortune
#cowsay
#figlet
#toilet
#cmatrix

#xonsh xonsh-doc
# outdated
# it is better to install the latest appimage

# optional lisp dev deps
# sbcl sbcl-doc guile-3.0 guile-3.0-doc

# printer drivers
printer-driver-gutenprint

# this should go at the end
# we will lose internet connection afterwards
# IMPORTANT: remember to edit /etc/network/interfaces comment out lines about wifi
# otherwise network manager is not going to be able to manage your internet connection properly
network-manager
network-manager-config-connectivity-debian
